#!/usr/bin/env python
# -*- coding: utf-8 -*-
# @Time    : 2026-09-05 23:20
# @File    : demo02.py
# @Software: PyCharm

"""

"""


def clear_list(l):
    l = []


l1 = [1, 2, 3]
clear_list(l1)

print(l1)

print("====================")

# Python 函数的**默认参数只会在函数定义的时候创建 1 次，不是每次调用函数新建**。
# 如果默认参数是可变类型：`[]`、`{}`、`set()`，多次调用会共享同一个对象，上次调用的残留数据会保留。
# 这个`[1]`**不是在函数调用时创建，是定义函数`def fl(...)`这一行执行的时候就创建出来的列表对象**。
#
# 它**不是全局变量**，不在全局命名空间，所以你直接敲`l`访问不到。
# 它存在于**函数对象的 `__defaults__` 属性里面**。
# `__defaults__` 是函数对象自带的元组，保存所有默认参数对象

def fl(l: list = [1]):
    l.append(1)
    print(l)


# 打印函数的默认参数元组
print(fl.__defaults__)
# ([1],)

fl()
print(fl.__defaults__)
# ([1, 1],)

fl()
print(fl.__defaults__)
# ([1, 1, 1],)


# ### 函数调用参数的传递方式是值传递还是引用传递？
#
# Python的参数传递有：位置参数、默认参数、可变参数、关键字参数。
# 函数的传值到底是值传递还是引用传递、要分情况：
# 不可变参数用值传递：像整数和字符串这样的不可变对象，是通过拷贝进行传递的，因为你无论如何都不可能在原处改变不可变对象。
# 可变参数是引用传递：比如像列表，字典这样的对象是通过引用传递、和C语言里面的用指针传递数组很相似，可变对象能在函数内部改变。